[{
  "_id": {
    "$oid": "65c49f1b21918c6b4f3eb212"
  },
  "url": "blog/post1",
  "image_path": "/images/samvadPrarambh.jpg",
  "heading": "Episode 1 : Samvad Prarambh | संवाद प्रारंभ",
  "author_name": "Shivansh Kothari",
  "date_created": {
    "$date": "2024-02-08T09:30:03.245Z"
  },
  "last_modified": {
    "$date": "2024-02-08T09:30:03.245Z"
  },
  "tags": [
    "myvedicjourney Episode 1",
    "myvedicjourney Shivansh Kothari",
    "myvedicjourney संवाद प्रारंभ"
  ],
  "post_text": "Namaste!🙏 How are you doing today? I hope you're fine. If not, let's work something out. We all know that when exploring any asset or commodity, we delve into its details. Similarly, let us embark on a journey to test the waters and understand the consequences of living our lives according to the Bhagavad Gita.<br><br>So, let's begin by unraveling the origin of the Bhagavad Gita.<br><br>Our story takes us to the sacred battlefield of Kurukshetra, where the armies of the Kauravas and the Pandavas stand poised for a momentous clash. The atmosphere crackles with anticipation as warriors prepare for the imminent confrontation. Amidst this grand setting, the mighty warrior Arjuna finds himself engulfed in a profound inner conflict. He is torn between fulfilling his duty as a warrior and the ethical dilemma of fighting against his own relatives and loved ones.<br><br>Arjuna's mind is filled with confusion and doubt. Overwhelmed by the gravity of the situation, he turns to his charioteer, who happens to be none other than Lord Krishna himself. Recognizing Arjuna's state of distress, Lord Krishna assumes the role of a divine guide and initiates a profound conversation with Arjuna.<br><br>In Chapter 1 of the Bhagavad Gita, titled \"Arjuna Vishada Yoga\" or \"The Yoga of Arjuna's Dejection,\" Arjuna pours out his deep anguish and despair to Lord Krishna. He shares his concerns about the moral implications and the consequences of engaging in the battle. Arjuna questions whether it is better to renounce the fight altogether than to engage in a war that would lead to the destruction of families and righteousness.<br><br>Amidst Arjuna's emotional turmoil, Lord Krishna imparts divine wisdom, setting the stage for the teachings that will follow in subsequent chapters. The shlokas of the Bhagavad Gita provide profound insights into the nature of life, duty, and spiritual enlightenment. <br><br>Allow me to share a couple of verses that shed light on Arjuna's predicament:<br><br>\"कर्मण्येवाधिकारस्ते मा फलेषु कदाचन |<br>मा कर्मफलहेतुर्भूर्मा ते संगोऽस्त्वकर्मणि\" (Bhagavad Gita 2.47)<br><br>Translation: \"You have the right to perform your prescribed duty, but you are not entitled to the fruits of your actions. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.\"<br><br>These words from Lord Krishna emphasize the importance of performing one's duty without attachment to the outcomes. They encourage individuals to focus on their actions and responsibilities without being overly concerned about the results.<br><br>To further captivate your interest, let me share a fascinating story related to the Bhagavad Gita. It is said that as the celestial sage Narada was boasting about his vast knowledge, he approached Lord Vishnu seeking validation. In response, Lord Vishnu handed him a leaf and asked him to count the number of devotees of Lord Vishnu residing on the leaf. Narada, using his immense knowledge and perception, searched every inch of the leaf but couldn't find any devotees. Perplexed, he returned to Lord Vishnu, who then smiled and handed him a different leaf. This time, to Narada's amazement, he found countless devotees on the leaf. Lord Vishnu explained that the first leaf contained individuals who possessed knowledge but lacked devotion, while the second leaf represented those with both knowledge and devotion. This story illustrates the significance of combining knowledge and devotion in our spiritual pursuits.<br><br>Stay tuned for the upcoming episodes, where we will delve deeper into the timeless wisdom of the Bhagavad Gita. Until then, ponder upon the profound teachings we have explored today. Feel free to share your thoughts and questions. Together, let us embark on a transformative journey through the sacred scriptures of the Bhagavad Gita.",
  "id": 1,
  "__v": 0
},
{
  "_id": {
    "$oid": "65c4a395863ee0dd896ce75d"
  },
  "url": "blog/post4",
  "image_path": "/images/gyan.png",
  "heading": "Episode 4: The Yoga of Knowledge | ज्ञान योग",
  "author_name": "Shivansh Kothari",
  "date_created": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "last_modified": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "tags": [
    "myvedicjourney Episode 4",
    "myvedicjourney Shivansh Kothari",
    "myvedicjourney The Yoga of Knowledge",
    "myvedicjourney ज्ञान योग"
  ],
  "post_text": "Namaste!🙏 I hope you're having a blissful day filled with serenity and inspiration. Welcome back to our exploration of the profound teachings of the Bhagavad Gita. Today, we embark on Episode 4: 'The Yoga of Knowledge | ज्ञान योग.'<br><br>In the previous episode, we delved into the concept of Karma Yoga, where Lord Krishna emphasized the importance of performing one's duty without attachment to the results. Now, in Chapter 4 of the Bhagavad Gita, titled 'Jnana Karma Sanyasa Yoga' or 'The Yoga of Renunciation of Action in Knowledge,' Lord Krishna reveals the ancient wisdom of the eternal path and the interplay between knowledge and action.<br><br>Lord Krishna imparts the profound teachings of Jnana Karma Sanyasa, elucidating that true knowledge arises from the understanding of the eternal nature of the soul and the divine essence pervading all beings. He emphasizes the importance of acquiring spiritual wisdom from a realized teacher and the continuity of this knowledge through the lineage of enlightened masters.<br><br>A verse that encapsulates this teaching is:<br><br>\"वीतरागभयक्रोधा मन्मया मामुपाश्रिताः |<br>बहवो ज्ञानतपसा पूता मद्भावमागताः\" (Bhagavad Gita 4.10)<br> <br><br>Translation: \"Being freed from attachment, fear, and anger, absorbed in Me and taking refuge in Me, many persons in the past became purified by knowledge of Me, and thus, they attained My divine nature.\"<br>This verse highlights the transformative power of knowledge and the importance of surrendering to the divine. When we let go of attachments, fears, and anger, and turn our focus inward, we can attain purification and union with the divine essence.<br><br>To illustrate the teachings of Jnana Karma Sanyasa, let me share an enlightening story. It is said that in ancient India, a king sought a wise sage to enlighten him. The sage, recognizing the king's sincerity, revealed a precious secret: the power of self-realization. He explained that just as a pearl lies hidden within an oyster's shell, true knowledge resides within us. The sage guided the king on a journey of self-discovery, helping him transcend the limitations of his identity and awaken to his divine nature. This story reminds us that the path of knowledge leads us to the realization of our inherent divinity.<br><br>Reflecting on the profound teachings of Jnana Karma Sanyasa, we understand that true knowledge arises from realizing our eternal essence and transcending the boundaries of the material world. The Bhagavad Gita guides us to seek wisdom from enlightened beings, cultivate inner stillness, and recognize the divinity within ourselves and all living beings.<br>Stay tuned for our next episode, where we will continue to explore the timeless wisdom of the Bhagavad Gita. Take a moment to contemplate the teachings we have delved into today and integrate them into your own spiritual journey. Together, let us walk the path of knowledge and discover the infinite potential within.<br><br>Wishing you a day filled with profound insights and inner illumination. Until next time, embrace the teachings of Jnana Karma Sanyasa and let them guide your path.",
  "id": 4,
  "__v": 0
},
{
  "_id": {
    "$oid": "65c4a395863ee0dd896ce75b"
  },
  "url": "blog/post2",
  "image_path": "/images/arjunsdilemma.png",
  "heading": "Episode 2: Arjun's Dilemma | अर्जुन की द्वंद्विता",
  "author_name": "Shivansh Kothari",
  "date_created": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "last_modified": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "tags": [
    "myvedicjourney Arjun's Dilemma",
    "myvedicjourney Episode 1",
    "myvedicjourney Shivansh Kothari",
    "myvedicjourney अर्जुन की द्वंद्विता"
  ],
  "post_text": "Namaste!🙏 I hope you're doing well on this beautiful day. Welcome back to our exploration of the profound teachings of the Bhagavad Gita. Today, we dive into Episode 2: \"Arjuna's Dilemma | अर्जुन की द्वंद्विता.\"<br><br>In the previous episode, we witnessed Arjuna's deep anguish and confusion as he stood on the battlefield of Kurukshetra, torn between his duty as a warrior and the moral implications of fighting against his own relatives and loved ones. Overwhelmed by the gravity of the situation, he sought guidance from his charioteer, none other than Lord Krishna.<br><br><br><br>Chapter 2 of the Bhagavad Gita, titled \"Sankhya Yoga\" or \"The Yoga of Knowledge,\" unfolds as Lord Krishna responds to Arjuna's despondency. In this chapter, Lord Krishna imparts profound wisdom and philosophical insights that have resonated through the ages.<br><br><br><br>Lord Krishna begins by dispelling Arjuna's confusion and presenting the eternal nature of the soul. He explains that the soul is eternal, indestructible, and transcendent to the physical body. The essence of life is not limited to birth and death but continues in an everlasting cycle of existence.<br><br><br>One of the pivotal verses that encapsulates the essence of this teaching is:<br><br>\"वासांसि जीर्णानि यथा विहाय<br>नवानि गृह्णाति नरोऽपराणि |<br>तथा शरीराणि विहाय जीर्णा<br>न्यन्यानि संयाति नवानि देही\" (Bhagavad Gita 2.22)<br><br>Translation: \"Just as a person puts on new garments after discarding old ones, similarly, the soul acquires new bodies after casting off the old and useless ones.\"<br><br><br><br>Through this analogy, Lord Krishna illustrates the cyclical nature of life and death, emphasizing that the soul is eternal and the physical body is merely a temporary vessel.<br><br><br><br>As the conversation between Lord Krishna and Arjuna progresses, the teachings delve into the concepts of duty, righteousness, and detachment. Lord Krishna elucidates the significance of performing one's duty, emphasizing the importance of righteous actions without attachment to the outcomes.<br><br><br><br>To further enrich our understanding, let me share an insightful story. It is said that during Lord Rama's exile, a humble hunter accidentally wounded a sage. The sage, despite being in pain, exhibited compassion and forgave the hunter, instructing him to seek redemption by chanting the name of Lord Rama. Overwhelmed by guilt, the hunter earnestly chanted the divine name and eventually attained liberation. This story exemplifies the power of devotion, the importance of seeking redemption, and the transformative effects of divine grace.<br><br><br><br>Reflecting on the profound teachings of the Bhagavad Gita, we are reminded of the eternal truths that guide our lives. The wisdom encapsulated within its verses transcends time, offering solace, clarity, and guidance in the face of life's challenges.<br><br><br><br>Stay tuned for our next episode, where we will explore further chapters of the Bhagavad Gita. Feel free to share your thoughts and reflections on today's teachings. Together, let us continue this transformative journey of self-discovery and spiritual enlightenment.<br><br><br><br>Wishing you a day filled with peace and inner harmony. Until next time, embrace the eternal wisdom of the Bhagavad Gita and let it illuminate your path.",
  "id": 2,
  "__v": 0
},
{
  "_id": {
    "$oid": "65c4a395863ee0dd896ce75c"
  },
  "url": "blog/post3",
  "image_path": "/images/karma.png",
  "heading": "Episode 3: Episode 3: The Yoga of Action | कर्म योग",
  "author_name": "Shivansh Kothari",
  "date_created": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "last_modified": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "tags": [
    "myvedicjourney Episode 3",
    "myvedicjourney Shivansh Kothari",
    "myvedicjourney The Yoga of Action",
    "myvedicjourney कर्म योग"
  ],
  "post_text": "Namaste!🙏 I hope you're having a wonderful day filled with positivity and grace. Welcome back to our journey through the profound teachings of the Bhagavad Gita. Today, we delve into Episode 3: 'The Yoga of Action | कर्म योग.'<br><br><br><br>In the previous episode, we witnessed Arjuna's dilemma and Lord Krishna's guidance, where the eternal nature of the soul and the importance of performing one's duty without attachment were illuminated. Now, in Chapter 3 of the Bhagavad Gita, titled 'Karma Yoga' or 'The Yoga of Action,' Lord Krishna further expounds on the significance of righteous action and selfless service.<br><br><br><br>Lord Krishna elucidates the essence of Karma Yoga by emphasizing that one should not renounce action but rather perform it with a sense of duty and surrender to the Divine. He explains that true renunciation is not the abandonment of action but the renunciation of attachment to the fruits of action.<br><br>A verse that encapsulates this teaching is:<br><br>\"कर्मण्येवाधिकारस्ते मा फलेषु कदाचन |<br><br>मा कर्मफलहेतुर्भूर्मा ते संगोऽस्त्वकर्मणि\" (Bhagavad Gita 2.47)<br><br>Translation: \"You have the right to perform your prescribed duty, but you are not entitled to the fruits of your actions. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.\"<br><br><br><br>This verse emphasizes the importance of selfless action and detachment from the outcomes. By performing our duties without expectations, we attain a state of freedom from the burdens of success or failure, allowing us to act with pure intentions and unwavering devotion.<br><br><br><br>To illustrate the teachings of Karma Yoga, let me share an inspiring story. It is said that in ancient times, a sage was performing a yajna (sacred fire ritual) in a forest. As he offered oblations into the fire, various animals, including birds and insects, gathered around out of curiosity. A deer, touched by the sage's compassion, decided to contribute in its own way. It plucked a blade of grass and offered it with deep reverence. The sage, recognizing the deer's sincere intention, accepted the humble offering with gratitude. This story beautifully portrays that it's not the magnitude of the action but the purity of intention and selfless devotion that truly matters.<br><br><br><br>Reflecting on the profound teachings of Karma Yoga, we realize that every action can become an offering when performed with a sense of duty, devotion, and selflessness. The Bhagavad Gita reminds us that by embracing Karma Yoga, we can infuse our lives with purpose, meaning, and spiritual growth.<br><br><br><br>Stay tuned for our next episode, where we will continue to unravel the timeless wisdom of the Bhagavad Gita. Take a moment to contemplate the teachings we have explored today and incorporate them into your own life. Together, let us walk the path of selfless action and find fulfillment in the service of others.<br><br><br><br>Wishing you a day filled with meaningful actions and inner harmony. Until next time, let the light of Karma Yoga guide your path.",
  "id": 3,
  "__v": 0
},
{
  "_id": {
    "$oid": "65c4a395863ee0dd896ce75e"
  },
  "url": "blog/post5",
  "image_path": "/images/sanyasyoga.jpg",
  "heading": "Episode 5: The Yoga of Renunciation | संन्यास योग",
  "author_name": "Shivansh Kothari",
  "date_created": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "last_modified": {
    "$date": "2024-02-08T09:49:09.095Z"
  },
  "tags": [
    "myvedicjourney Episode 5",
    "myvedicjourney Shivansh Kothari",
    "myvedicjourney The Yoga of Renunciation",
    "myvedicjourney संन्यास योग"
  ],
  "post_text": "Namaste!🙏 I hope you're experiencing a day filled with peace and spiritual growth. Welcome back to our profound journey through the teachings of the Bhagavad Gita. Today, we embark on Episode 5: 'The Yoga of Renunciation | संन्यास योग.'<br><br>In the previous episode, we explored the path of knowledge and the interplay between wisdom and action. Now, in Chapter 5 of the Bhagavad Gita, titled 'Karma Sanyasa Yoga' or 'The Yoga of Renunciation,' Lord Krishna imparts profound insights on the significance of renunciation and its role in attaining spiritual liberation.<br><br>Lord Krishna explains that there are two paths to spiritual enlightenment: the path of renunciation (sanyasa) and the path of selfless action (karma yoga). He elucidates that both paths, when practiced with the right understanding, lead to the ultimate goal of self-realization.<br><br>Contrary to popular perception, renunciation does not necessarily imply abandoning one's duties and responsibilities. Rather, true renunciation is the detachment from the fruits of action and the surrender of one's ego to the divine will. Lord Krishna emphasizes that true renunciates are those who perform their duties with selflessness and offer the results of their actions to the divine.<br><br>A verse that beautifully encapsulates this teaching is:<br><br>\"योगिनः कर्म कुर्वन्ति सङ्गं त्यक्त्वाऽत्मशुद्धये |<br>सर्वकर्मफलत्यागं प्राहुस्त्यागं विचक्षणाः\" (Bhagavad Gita 5.11)<br><br>Translation: \"The wise, who are endowed with true knowledge, perform their duties without attachment, surrendering the results of their actions for the purification of their hearts. In the eyes of the wise, giving up the fruits of all activities is called renunciation.\"<br><br>This verse emphasizes that renunciation is not limited to external renouncement but is primarily an inner state of detachment. It is the surrender of the ego and the relinquishment of the desire for personal gain.<br><br>To illustrate the teachings of Karma Sanyasa Yoga, let me share an inspiring story. It is said that in ancient times, a great saint lived in a remote village. Despite possessing immense wealth, he lived a simple life and selflessly served the community. One day, a wealthy merchant sought the saint's guidance, believing that renunciation could only be attained by abandoning material possessions. The saint smiled and invited the merchant to observe his actions. The saint performed his duties with selflessness, giving generously to those in need. The merchant, enlightened by the saint's example, realized that true renunciation lies not in external possessions but in the purity of one's intentions and actions.<br><br>Reflecting on the profound teachings of Karma Sanyasa Yoga, we understand that renunciation is not about forsaking our responsibilities or material possessions. It is about cultivating an inner state of detachment and offering our actions and their outcomes to the divine.<br><br>Stay tuned for our next episode, where we will continue to unravel the timeless wisdom of the Bhagavad Gita. Take a moment to contemplate the teachings we have explored today and integrate them into your own spiritual practice. Together, let us embrace the path of renunciation and selfless action for the purification of our hearts.<br><br>Wishing you a day filled with inner detachment and spiritual clarity. Until next time, let the essence of renunciation guide your path.",
  "id": 5,
  "__v": 0
}]